app/controllers/chat_controller.rb

SELECT "secure_users"."friendlist" FROM "secure_users" WHERE "secure_users"."id" = $1  [["id", 2]]
SELECT  "secure_users".* FROM "secure_users" WHERE "secure_users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "secure_users".* FROM "secure_users" WHERE "secure_users"."id" IN (9, 10, 12) ORDER BY firstname LIMIT $1  [["LIMIT", 11]]
---
  def index
    # Look up friendlist column from DB
    secure_users_friendlist = SecureUser.select(:friendlist).where(id: session[:user_id])
    # Create an empty array and assign friendlist to it
    secure_users_friend = Array.new
    secure_users_friendlist.each do |f|
      secure_users_friend = f.friendlist.to_a
    end
    # Get list of users based on friendlist
    secure_users_friends = SecureUser.where(id: secure_users_friend).order("firstname")