app/controllers/profile_controller.rb

SELECT "secure_users"."friendlist" FROM "secure_users" WHERE "secure_users"."Id" = $1  [["Id", 2]]
SELECT "secure_users".* FROM "secure_users" WHERE (((lower(firstname) ILIKE lower('gm%')) OR (lower(lastname) ILIKE lower('gm%'))) OR (lower(username) ILIKE lower('gm%')))
SELECT  "secure_users".* FROM "secure_users" WHERE "secure_users"."id" IN (2, 9) ORDER BY firstname LIMIT $1  [["LIMIT", 11]]
SELECT "secure_users"."friendrequests" FROM "secure_users" WHERE "secure_users"."id" = $1  [["id", 2]]
---
  def index

####Code for displaying friend list

    # Look up friendlist column from database
    secure_users_friendlist = SecureUser.select(:friendlist).where(id: session[:user_id])
    # Create an empty array and assign friendlist to it
    friendlist_user_ids = Array.new
    secure_users_friendlist.each do |f|
      friendlist_user_ids = f.friendlist.to_a
    end

    # Get list of users based on friendlist
    @secure_user_friendlist = SecureUser.where(id: friendlist_user_ids).order("firstname")

####Code for displaying friend requests

    # Look up friendlist column from DB
    secure_users_friendrequests = SecureUser.select(:friendrequests).where(id: session[:user_id])

SELECT "secure_users"."friendrequests" FROM "secure_users" WHERE "secure_users"."id" = $1  [["id", 12]]
SELECT  "secure_users".* FROM "secure_users" WHERE "secure_users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "secure_users" SET "friendrequests" = $1, "updated_at" = $2 WHERE "secure_users"."id" = $3  [["friendrequests", "{2}"], ["updated_at", "2019-12-01 02:14:04.190981"], ["id", 12]]
---
  def addfriendrequest

    # Assign requestee and requestor to variable
    requested_friend_id = params[:user_to_add]
    requesting_friend_id = session[:user_id]

    # Look up friendrequests column from database for user we are wanting to add
    secure_users_friendrequests = SecureUser.select(:friendrequests).where(id: requested_friend_id)

    # Create an empty array and assign friendrequests to it
    friendrequests = Array.new
    secure_users_friendrequests.each do |f|
      friendrequests = f.friendrequests.to_a
    end

    # Creating string array
    friendrequests_string = Array.new
    friendrequests.each { |a| friendrequests_string.push(a.to_s) }

SELECT "secure_users"."friendlist", "secure_users"."friendrequests" FROM "secure_users" WHERE "secure_users"."id" = $1  [["id", 2]]
SELECT  "secure_users".* FROM "secure_users" WHERE "secure_users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def acceptfriendrequest

    # Get current user and requesting user ids and assign to variables
    requesting_friend_id = params[:user_to_add]
    current_user_id = session[:user_id]

    # Look up columns from database for current user and requesting user
    current_user_lists = SecureUser.select(:friendlist, :friendrequests).where(id: current_user_id)
    requesting_user_lists = SecureUser.select(:friendlist).where(id: requesting_friend_id)

    # Create new arrays for current user and assign lists to them
    current_user_friendlist = Array.new
    current_user_friendrequests = Array.new
    current_user_lists.each do |f|

SELECT "secure_users"."friendrequests" FROM "secure_users" WHERE "secure_users"."id" = $1  [["id", 26]]
SELECT  "secure_users".* FROM "secure_users" WHERE "secure_users"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
UPDATE "secure_users" SET "friendrequests" = $1, "updated_at" = $2 WHERE "secure_users"."id" = $3  [["friendrequests", nil], ["updated_at", "2019-12-01 03:06:04.759805"], ["id", 26]]
---
  def deletefriendrequest

    # Get current user and requesting user ids and assign to variables
    requesting_friend_id = params[:user_to_delete]
    current_user_id = session[:user_id]

    # Look up columns from database for current user and requesting user
    current_user_lists = SecureUser.select(:friendrequests).where(id: current_user_id)

    # Create new arrays for current user and assign lists to them
    current_user_friendrequests = Array.new
    current_user_lists.each do |f|
      current_user_friendrequests = f.friendrequests.to_a
    end

    # Creating string array
    current_user_friendrequests_string = Array.new
    current_user_friendrequests.each { |a| current_user_friendrequests_string.push(a.to_s) }

    # Remove requesting user from current user's friend requests
    current_user_friendrequests_string.delete(requesting_friend_id)

    # Set values for current user's write to database
    current_user = SecureUser.find_by id: (current_user_id)
    current_user.friendrequests = current_user_friendrequests_string

    # Run updates and display according messages
    respond_to do |format|
      if current_user.save

SELECT "secure_users"."friendlist" FROM "secure_users" WHERE "secure_users"."id" = $1  [["id", 12]]
SELECT  "secure_users".* FROM "secure_users" WHERE "secure_users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def deletefriend

    # Get current user and friend's user ids and assign to variables
    friend_id = params[:user_to_delete]
    current_user_id = session[:user_id]

    # Look up columns from database for current user and requesting user
    current_user_lists = SecureUser.select(:friendlist).where(id: current_user_id)
    friend_user_lists = SecureUser.select(:friendlist).where(id: friend_id)

    # Create new arrays for current user and assign lists to them
    current_user_friendlist = Array.new
    current_user_lists.each do |f|