app/controllers/secure_users_controller.rb

  def index
    @secure_user = SecureUser.all
---
SELECT "secure_users".* FROM "secure_users"

  def show
    puts params[:search_text]
    user = SecureUser.find_by firstname: (params[:search_text])
---
SELECT  "secure_users".* FROM "secure_users" WHERE "secure_users"."firstname" IS NULL LIMIT $1  [["LIMIT", 1]]

  def create
    @secure_user = SecureUser.new(secure_user_params)

    respond_to do |format|
      if @secure_user.save
---
INSERT INTO "secure_users" ("email", "password_digest", "created_at", "updated_at", "username", "firstname", "lastname") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @secure_user.update(secure_user_params)
---
UPDATE "secure_users" SET "password_digest" = $1, "updated_at" = $2 WHERE "secure_users"."id" = $3  [["password_digest", "$2a$12$ZPQjPH0Q3pzUt07LvaeUfejm3h1KpZ4b5CJ8liUMGJx7uCDd/DjFa"], ["updated_at", "2019-10-23 02:29:02.360961"], ["id", 1]]

  def destroy
    # TODO: Delete user in CometChatPro
    # CometChatService.delete(@secure_user.username).delete_user

    # TODO: Remove user from all of their friend's friend lists

    # Remove user from database
    @secure_user.destroy
---
DELETE FROM "secure_users" WHERE "secure_users"."id" = $1  [["id", 8]]

    def set_secure_user
      @secure_user = SecureUser.find(params[:id])
---
SELECT  "secure_users".* FROM "secure_users" WHERE "secure_users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]