app/controllers/sessions_controller.rb

SELECT  "secure_users".* FROM "secure_users" WHERE "secure_users"."email" = $1 LIMIT $2  [["email", "andrew.jacobson22@gmail.com"], ["LIMIT", 1]]
---
  def create
    user = SecureUser.find_by email: (params[:email])